_Rarzrabotki/Kazna/AccumulationRegisters/СчетаПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>СчетаПоставщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаОплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВКБ</Name>
					<Comment>Движение по заявке, если она по счету на оплату поставщику (+дата документа, "-" дата платежа)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/СчетаПоставщиков/Ext/RecordSetModule.bsl
Процедура ВыполнитьСторноОстатка(Ссылка, Дата) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетаНалОстатки.СчетНаОплатуПоставщика,
	|	-СчетаНалОстатки.СуммаОстаток КАК Сумма,
	|	-СчетаНалОстатки.НаОплатуОстаток КАК НаОплату,
	|	-СчетаНалОстатки.ВКБОстаток КАК ВКБ
	|ИЗ
	|	РегистрНакопления.СчетаПоставщиков.Остатки(&Дата, СчетНаОплатуПоставщика = &Документ) КАК СчетаНалОстатки"
	);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Период = Дата;
	КонецЕсли; 
	
	Записывать = Истина;
	
КонецПроцедуры
